app/channels/application_cable/connection.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def find_verified_user
        if current_user = User.find_by(id: request.params[:user])