app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def authorize_request
    header = request.headers['Authorization']
    header = header.split(' ').last if header
    begin
      @decoded = JsonWebToken.decode(header)
      @current_user = User.find(@decoded[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "mem"], ["LIMIT", 1]]
---
  def handle_login username, password
    @user = User.find_by_username(username)