app/controllers/chats_controller.rb

SELECT  "chats".* FROM "chats" WHERE "chats"."from_id" = $1 LIMIT $2  [["from_id", 1], ["LIMIT", 1]]
SELECT  "chats".* FROM "chats" WHERE "chats"."to_id" = $1 LIMIT $2  [["to_id", 1], ["LIMIT", 1]]
---
  def index
    @chats_from = Chat.where from_id: @user.id
    @chats_to = Chat.where to_id: @user.id

INSERT INTO "chats" ("created_at", "updated_at", "to_id", "from_id", "from_username", "to_username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2019-07-13 20:07:47.704736"], ["updated_at", "2019-07-13 20:07:47.704736"], ["to_id", 1], ["from_id", 9], ["from_username", "hon"], ["to_username", "mem"]]
---
  def create
    @chat = Chat.new chat_params

    if @chat.save

UPDATE "chats" SET "title" = $1, "updated_at" = $2 WHERE "chats"."id" = $3  [["title", "ChatChatChat"], ["updated_at", "2019-07-08 22:00:53.124162"], ["id", 3]]
---
  def update
    if @chat.update chat_params

DELETE FROM "chats" WHERE "chats"."id" = $1  [["id", 3]]
---
  def destroy
    @chat.destroy

SELECT  "chats".* FROM "chats" WHERE "chats"."from_id" = $1 AND "chats"."id" = $2 LIMIT $3  [["from_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "chats".* FROM "chats" WHERE "chats"."from_id" = $1 AND "chats"."to_id" = $2  [["from_id", 1], ["to_id", 2]]
---
    def set_chat
      @user_chats = Chat.where from_id: params[:user_id]
      @chat = @user_chats.where to_id: params[:id]

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_user
      @user = User.find params[:user_id]