app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "chat_id", "created_at", "updated_at", "from_username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "how are you"], ["chat_id", 2], ["created_at", "2019-07-13 17:12:32.533751"], ["updated_at", "2019-07-13 17:12:32.533751"], ["from_username", "jill"]]
---
  def create
    @message = Message.new(message_params)

    if @message.save

UPDATE "messages" SET "content" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["content", "goodbye for now"], ["updated_at", "2019-07-10 14:41:15.017399"], ["id", 2]]
---
  def update
    if @message.update(message_params)

DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 2]]
---
  def destroy
    @message.destroy

SELECT "chats"."id" FROM "chats" WHERE "chats"."from_id" = $1 AND "chats"."to_id" = $2  [["from_id", 0], ["to_id", 0]]
SELECT  "messages".* FROM "messages" WHERE "messages"."chat_id" IN ($1, $2) AND "messages"."id" = $3 LIMIT $4  [["chat_id", 1], ["chat_id", 2], ["id", 1], ["LIMIT", 1]]
---
    def set_messages
      @chat =  Chat.where from_id: params[:user_id], to_id: params[:chat_id]
      @messages = Message.where chat_id: @chat.ids